<html>
<head>
<title>教务管理系统 | 产品  | 宇威科技</title>
<?php include 'common.php';?>
</head>

<style>
p {
	line-height: 30px;
}
</style>

<body>
	<?php include 'nav.php';?>
	<div class="container" style="margin-top: 50px;">
		<ul class="breadcrumb"
			style="margin-top: 20px; background-color: white">
			<li><span class="glyphicon glyphicon-home"></span> &nbsp;<a
				href="index.php">首页</a><span class="divider"></span></li>
			<li>产品介绍</li>
			<li class="active">教务管理系统</li>
		</ul>

		<div class="row">

			<div class="col-md-3">
				<img src="img/school-1.jpg" class="img-responsive">
			</div>
			<div class="col-md-9" style="line-height: 30px">
				适用于大中专院校、中学教务管理的管理系统。系统涵盖高校和中学教务管理工作所有环节，涉及到基本信息、学生学籍、教学安排(网上选课/课表编排)、考试事务（考务管理、在线考试）、报名管理、证书管理、公寓管理、教学管理（课件管理、作业管理）学生成绩、教学考评、毕业处理（毕业设计、毕业管理）、就业管理与系统管理十三个方面，基于校园网/互联网为学校教学工作提供先进实用的信息化管理手段
			</div>
		</div>
		<hr>

		<div>
			<button class="btn btn-primary" type="button">
				<span class="badge">1</span> 功能强大
			</button>
			<p style="margin-top: 20px">　　本公司教务软件系统适用于大中专院校、中学教务管理的管理系统，包括了学校教务必须使用的大部分功能。包括： 教务管理系统， 教师评价系统， 成绩管理系统，证书查询系统，在线报名系统，自定表单系统，门户管理子系统，考试安排系统，在线考试系统，自动排课系统，公寓管理系统，课件管理系统，作业管理系统，就业信息系统，毕业设计系统。</p>
			<p>　　所开发的系统均使用大型关系数据库SQLServer、采用流行的三层体系构架、采用最大扩展性的B/S结构、采用先进的C#语言编写、功能集成度高、框架灵活、模块化设计、界面操作简单、具有丰富的自定义功能、定制查询、先进的加密技术等特点。</p>
		</div>
		<div style="margin-top: 20px">
			<button class="btn btn-success" type="button">
				<span class="badge">2</span> 性价比高
			</button>
			<p style="margin-top: 20px">　　以同行业一流管理系统为功能标准，以工作室式低成本运营模式，以性价比高于同类产品数倍为产品价格定位。</p>
		</div>
		<div style="margin-top: 20px">
			<button class="btn btn-warning" type="button">
				<span class="badge">3</span> 配置灵活
			</button>
			<p style="margin-top: 20px">　　系统的设计思想在整体上突出系统的易集成性和可扩充性，而各子系统则强调针对性和相对独立性，力求各子系统既可尽可能地独立专用，又能实现信息共享和无缝集成。这不仅在整体上降低了系统的复杂程度，而且同时又增强了各子系统在功能上的针对性、操作上的简便性和信息处理的灵活性。</p>
		</div>
		<div style="margin-top: 20px">
			<button class="btn btn-info" type="button">
				<span class="badge">4</span> 简单易用
			</button>
			<p style="margin-top: 20px">　　系统界面简单直观，操作统一，便于用户掌握。使用AJAX无刷新技术，提高系统的交互能力，增加访问效果，更好的提高用户体验度和友好度。</p>
			
		</div>
		<div style="margin-top: 20px">
			<button class="btn btn-danger" type="button">
				<span class="badge">5</span> 可二次开发
			</button>
			<p style="margin-top: 20px">　　系统功能总是有限度的，如果现有功能不能完成特殊的需求，就需要提供二次开发的接口及服务，因此各产品支持二次功能开发，使系统可与二次开发功能模块无缝集成。</p>
			
		</div>

		<div style="margin-top: 20px">
			<button class="btn btn-primary" type="button">
				<span class="badge">6</span> 总体概述
			</button>
			<p style="margin-top: 20px">
				　　教务管理系统采用先进的.Net技术开发，数据库基于通用的数据库访问组件可以和Access2003/SQL2000/2005/2008无缝结合，采用AJAX技术无刷新更新系统。系统的性能和安全性得到了极大的保证。</p>
			<p>　　本系统主要的功能有基本设置系统，学生管理系统，教师管理系统，课程管理系统，课程表查询，公用信息系统，成绩管理系统，教师评价系统，证书管理系统，在线报名系统，自定表单系统，门户管理子系统，在线考试系统，（教学计划系统，学生品德评估系统，教师工资管理正在开发），满足了大多数学校的需求。系统设计的功能从学生入学到毕业的整个教务流程都可以采用软件进行操作，提高了学校的教务管理的方便性和准确性。
本系统的开发，是在原版本的基础上升级的，经过了广大用户的考验，得到了部分学校的大力支持，系统的易用性，通用性，移值性都经过良好的测试。系统的易用性在原系统的基础上在一次进行了提高，对于课程和班级，教师之间的关系操作也更灵活方便了。</p>
			<p>　　教务管理系统采用先进的.Net技术开发，数据库基于通用的数据库访问组件可以和Access2003/SQL2000/2005/2008无缝结合，采用AJAX技术无刷新更新系统。系统的性能和安全性得到了极大的保证。<br>　　本系统主要的功能有基本设置系统，学生管理系统，教师管理系统，课程管理系统，课程表查询，公用信息系统，成绩管理系统，教师评价系统，证书管理系统，在线报名系统，自定表单系统，门户管理子系统，在线考试系统，（教学计划系统，学生品德评估系统，教师工资管理正在开发），满足了大多数学校的需求。系统设计的功能从学生入学到毕业的整个教务流程都可以采用软件进行操作，提高了学校的教务管理的方便性和准确性。<br>本系统的开发，是在原版本的基础上升级的，经过了广大用户的考验，得到了部分学校的大力支持，系统的易用性，通用性，移值性都经过良好的测试。系统的易用性在原系统的基础上在一次进行了提高，对于课程和班级，教师之间的关系操作也更灵活方便了。<br>　　当然，系统可能还有很多功能没有实现，也可能有很多学校有更多的功能要求，本系统模块化的设计完全可以单独开发相关的模块在加入到系统之中，系统的可扩展性能极强。<br>　　系统主要特点如下：<br>　　系统采用B/S架构模式开发，只需要服务器安装程序即可，客户端通过浏览器即可访问。<br>　　系统基于角色，权限的设计模式，可以根据自己的需求随意增加用户和角色信息。后台菜单可以自行设置。<br>　　学校的学期，学年，校区，教室，院系，专业，班级，学生，教师，课程等基本信息完全都可以自己定义，适合不同学校的不同需求。<br>　　方便的数据导入导出机制，用户可以方便的将其他系统的数据安装标准格式导入到本系统，也可以把本系统的数据导出成EXCEL文件，在导入到相关系统。<br>　　丰富的统计图表提供学校进行准确的分析，图表采用.NET的GDI绘图技术和FLASH技术，支持饼图，柱状图等格式的图表进行对比分析。<br>　　系统提供数据字典功能，一些基本的数据，可以通过数据字典进行维护，完成增删改的操作。<br>　　系统采用模块的设计思想，可以根据用户的不同需求，使用不同的功能模块。<br>　　课程管理系统采用独家的设计思想，通过默认课程开设到院系，班级方便用户的录入信息和修改课程信息，而且还支持批量的课程调整功能。<br>　　成绩管理系统采用审核机制，防止教师发布错误的数据，也提供了成绩录入，成绩修改，成绩排序，成绩分析，班级成绩汇总，成绩对比功能。可以一次显示一个学生的全部学期的课程的成绩。<br>　　教师评价系统，支持自定义指标分组，指标值并自动进行汇总分析。<br>　　证书管理系统支持根据学号或者证书编号信息查询证书的功能，证书输入方便，支持图片和文字两种方式。 <br>　　系统还支持在线报名，自定义报名表单，留言板，门户网站管理子系统等功能，由于书面原因，不在叙述！<br></p>
		</div>
	</div>
	<?php include 'footer.php';?>
</body>